--1. Отобразить все издательства, которые выпустили новинки после 2000 года.
SELECT  

--2. Отобразить книги, у которых количество страниц больше, чем среднее арифметическое число страниц всех книг.

--3. Отобразить тематики и сумму страниц по тематикам, учитывая при этом только книги с ценой >50.

--4. Отобразить все темы, у которых не указана категория.

--5. Отобразить самую дорогую книгу издательства BHV (2 способа).

--6. Отобразить издательство, у которого наибольшее количество страниц (2 способа).

--7. Отобразить издательство, у которого наибольшее количество книг по программированию (2 способа).

--8. Определить, сколько издано книг по каждой тематике.

--9. Отобразить самую дешевую книгу в каждой из следующих тематик: Программирование, Базы данных клиент-сервер, Мультимедиа.

--10. Показать издательства и самую старую книгу для каждого из них.

--11. Показать количество выпущенных книг-новинок по каждому издательству.

--12. Отобразить издательство, у которого наибольшее количество книг-новинок (2 способа).

--13. Вывести процентный вклад каждой тематики в прайс-листе.

--14. Найти среднюю цену книг, выпущенных издательствами весной 1999 года, для каждого издательства.

--15. Вывести книгу, выпущенную наибольшим тиражом (2 способа).

--16. Вывести издательства, у которых число выпущенных книг превышает 5% от общего числа книг.

--17. Вывести книгу, в коде которой присутствуют ровно 2 семерки.

--18. Вывести издательства, из букв которых можно собрать слово «лак».

--19. Вывести книги, названия которых не содержат английских букв, с числом страниц, кратным 2.

--20. Вывести количество книг, у которых не указана дата выпуска.