--1. Ќаписать хранимую процедуру, котора€ показывает количество вз€тых книг по каждой из групп,
--и по каждой из кафедр (departments). 

--2. Ќаписать хранимую процедуру, показывающую список книг, отвечающих набору критериев.
-- ритерии: им€ автора, фамили€ автора, тематика, категори€.  роме того, список должен быть отсортирован по номеру пол€
--указанному в 5-м параметре, в направлении, указанном в 6-м параметре (sp_executesql).

--3. Ќаписать хранимую процедуру, котора€ показывает список библиотекарей, и количество выданных каждым из них книг.

--4. —оздать хранимую процедуру, котора€ покажет им€ и фамилию студента, набравшего наибольшее количество книг.


