--1. написать функцию, которая покажет список всех пользовательских баз данных SQL Server,
--и их общие размеры в Б.

--2. написать функцию, которая покажет список всех таблиц базы данных,
--название которой передано как параметр, количество записей в каждой из таблиц,
--и общий размер каждой таблицы в байтах.

--3. написать функцию, которая покажет список всех полей определённой таблицы,
--имя которой передаётся как параметр.
--если есть несколько одноимённых таблиц (в разных БД) - показать информацию по каждой таблице.
--кроме названия поля указать его тип, поддержку нулевых значений
--и перечень всех констреинтов (через запятую в одном поле).

--4. написать функцию, которая покажет количество приконнекченых к серверу пользователей.