
--Напишіть запит, який визначає тип кожного запису
--в таблиці TRIANGLES, використовуючи три довжини боків.
--Виведіть одне з наступних тверджень для кожного запису в таблиці:

--- рівностороння: це трикутник з трьома сторонами однакової довжини.
--- Двостороння: це трикутник з двома сторонами однакової довжини.
--- Scalene: це трикутник з трьома сторонами різної довжини.
--- Не трикутник: задані значення A, B та C не утворюють трикутника.

--Таблиця TRIANGLES описується наступним чином:

--A B C
--20 20 20
--20 20 21
--20 21 22
--20 21 60

--Кожен рядок у таблиці позначає довжину кожного з три сторони трикутника.

--Вибірка вибірки

--Рівносторонній
--Рівноправні
--Скаліне
--Не трикутник
USE TRIANGLES;
GO
CREATE PROCEDURE ProductSummary @n int, @a int ,@b int, @c int AS
BEGIN

	if @a=@b and @b=@c
	raiserror('рівностороння #%s', 0, 25,@n)
	else if @a=@b or @b=@c or @c=@a
	raiserror('Двостороння #%s', 0, 25,@n)
	else if @a != @b and @b != @c and @c != @a  
	and 
	raiserror('Скаліне #%s', 0, 25,@n)

END;