--1. при взятии определённой книги студентом или преподавателем,
--её количество в таблице Books должно уменьшаться на 1.

--2. сделать так, чтобы нельзя было выдать книгу,
--количество которой в библиотеке 0 (выдать сообщение - книги закончились).

--3. при возврате книги студентом или преподавателем,
--её количество в таблице Books должно увеличиваться на 1.

--4. сделать так, чтобы нельзя было выдать книгу студенту,
--если у него на руках 3 невозвращённые книги.

--5. нельзя выдать книгу студенту, если прошлую книгу он читал дольше двух месяцев.

--6. если студента зовут Александр, он получает 2 экземпляра книги вместо одного
--(если конечно книги в наличии)

--7. если в наличии нет книги, которую хочет взять преподаватель, выдать ему одну случайную книгу.
--если книги закончились вообще, выдать сообщение об этом.

--8. сделать так, чтобы нельзя было вернуть больше книг, чем их было изначально.


